[
  {
    "title": "Chocolate Brownies",
    "ingredients": [
      "½ cup unsalted Flora butter block (115g)",
      "1 cup granulated sugar (200g)",
      "2 large eggs",
      "1 tsp vanilla extract (5g)",
      "¾ cup gluten free plain flour (95g)",
      "¼ cup unsweetened cocoa powder (25g)",
      "½ tsp salt (3g)",
      "milk chocolate chunks (150g)",
      "dark chocolate chips (100g) (50% - 60%)"
    ],
    "instructions": [
      "Preheat oven to 175°C. Line an 8x8-inch tray with parchment paper or grease well.",
      "In a heatproof bowl over simmering water (or microwave in short bursts), melt butter and dark chocolate chips with 1/4 of the milk chocolate chunks, stirring until smooth and glossy. Let it cool slightly.",
      "In a mixing bowl, whisk together sugar, eggs, and vanilla until smooth and glossy.",
      "Slowly pour the melted chocolate mixture into the egg mixture while whisking gently to combine.",
      "Sift in flour, cocoa powder, and salt, then fold in gently until just combined. Don’t overmix.",
      "Fold in the remaining milk chocolate chunks.",
      "Pour batter into the pan and smooth the top.",
      "Bake for 22-25 minutes. Edges should be set but the centre slightly soft and fudgy. A toothpick should come out with moist crumbs, not clean.",
      "Let cool completely before slicing (or eat warm)."
    ],
    "image": "recipe-images/chocolate_brownies.jpg",
    "time": "45 mins", 
    "allergens": "gluten-free, nut-free",
    "updated": "30/08/2025",
    "source": "Baking Society"
  },
  {
    "title": "Baking Soc Cupcakes",
    "ingredients": {
      "batter": [
        "150g gluten free self-raising flour",
        "0.13 tsp salt",
        "2 large eggs",
        "150g caster sugar",
        "60g Flora Unsalted butter block, melted and cooled slightly",
        "125ml soya milk",
        "2 tsp vanilla extract",
        "15g vegetable oil"
      ],
      "frosting": [
        "150g Flora Unsalted Butter Block (softened)",
        "275g icing sugar, sifted",
        "1 tsp vanilla extract",
        "Purple food colouring (gel/paste)"
      ],
      "decoration": [
        "Sugar pearls",
        "Toothpicks, paper cut-outs, stickers"
      ]
    },
    "instructions": [
      "Preheat oven to 180°C (160°C fan). Line a 12-hole muffin tray with cupcake cases.",
      "Whisk self-raising flour and salt in a medium bowl.",
      "In a large bowl, whisk eggs and caster sugar until pale and slightly thick (1–2 mins).",
      "Add melted butter, oil, milk, and vanilla extract. Whisk until combined.",
      "Fold in dry ingredients gently until smooth. Do not overmix.",
      "Divide batter evenly into 12 cases (~⅔ full).",
      "Bake 18–22 minutes, until tops are golden and spring back when pressed. Do the toothpick test.",
      "Cool in the tin for 5 minutes, then transfer to a wire rack to cool completely.",
      "Make the frosting: beat butter for 2 minutes until creamy. Add half the icing sugar, beat, then add the rest. Mix in vanilla and purple colouring. Adjust with milk or sugar if needed.",
      "Decorate: pipe frosting with a star tip, sprinkle with sugar pearls, and add toppers."
    ],
    "image": "recipe-images/baking_soc_cupcakes_1.jpg",
    "time": "1hr 30 mins", 
    "allergens": "gluten-free, lactose-free, dairy-free",
    "updated": "30/08/2025",
    "source": "Baking Society"
  },
  {
    "title": "Butter Cookies",
    "ingredients": [
      "200g salted Flora Butter Block, at room temperature",
      "70g icing sugar, sifted",
      "½ tsp vanilla bean paste or vanilla extract",
      "210g gluten free plain flour, sifted",
      "30g corn starch",
      "20g soya milk",
      "Granulated sugar for finishing, optional"
    ],
    "instructions": [
      "Preheat the oven to 165°C. Line a baking sheet with parchment paper.",
      "Fit a piping bag with a large open star tip.",
      "Whip butter, sugar, and vanilla until light and fluffy.",
      "Mix in flour and corn starch just until incorporated. Add soya milk and mix again.",
      "Transfer mixture to piping bag. Pipe rosettes about 4.5 cm wide, leaving room for spreading.",
      "Sprinkle with granulated sugar if using.",
      "Bake 13–14 minutes, until set and lightly golden at edges (longer for crunchier cookies).",
      "Cool on the pan 15–20 minutes, then transfer to a rack.",
      "Store in an airtight container at room temperature for up to a week."
    ],
    "image": "recipe-images/butter_cookies.jpg",
    "time": "30 mins", 
    "allergens": "gluten-free, egg-free, dairy-free",
    "updated": "30/08/2025",
    "source": "cloudykitchen"
  },
  {
    "title": "Matcha Brownies",
    "ingredients": [
      "100g butter",
      "150g white chocolate",
      "2 eggs",
      "10g matcha powder",
      "80g low-gluten flour (or gluten-free plain flour)",
      "60g granulated sugar"
    ],
    "instructions": [
      "Melt butter, add white chocolate, and mix well until smooth.",
      "Beat eggs with sugar until combined.",
      "Gradually add the egg mixture into the chocolate-butter mixture, mixing gently.",
      "Sieve flour and matcha powder, then fold into the mixture until combined.",
      "Pour batter into a mold.",
      "Bake at 180°C for 15 minutes. Cover with foil and bake for another 10 minutes to prevent over-coloring.",
      "Cool completely before eating.",
      "Note: Brownies improve in flavor with time. Store well-sealed for long shelf life, suitable for gifting or mailing as snacks."
    ],
    "image": "recipe-images/matcha_brownies.jpg",
    "time": "30 mins",
    "allergens": "gluten-free, nut-free",
    "updated": "30/08/2025",
    "source": "Anonymous"
  },
  {
    "title": "Tartlet Shell Recipe",
    "ingredients": [
      "230g all purpose flour",
      "80g icing sugar",
      "A pinch of salt",
      "120g unsalted butter",
      "30g beaten eggs"
    ],
    "instructions": [
      "Put the flour, icing sugar and salt into a bowl. Then mix.",
      "And the butter to the bowl ‘rub in’ the butter with the flour mixture to make a crumbly dough.",
      "Add the egg and knead the dough until smooth.",
      "Wrap the dough in cling film and leave to rest in the fridge for 30 minutes.",
      "Dust your work surface with flour and roll out the dough til it is about 4-5mm(0.15 inch) thick.",
      "Use a cutter to cut out circles in the dough and drape them over the outsides of the buttered muffin tin.",
      "Trim the excess and prick the bases with a fork.",
      "Bake for 14 minutes at 170C"
    ],
    "image": "recipe-images/tarts.jpeg",
    "time": "1hr 4mins",
    "allergens": "nut-free",
    "updated": "09/10/2025",
    "source": "https://www.inlaurasbakery.com/how-to-make-tartlet-shells-easy-recipe/"
  },
  {
    "title": "Mixed Berry Tart Filling Recipe",
    "ingredients": [
      "230g Frozen Mixed Berries",
      "~40ml berry juice (from defrosted berries) ",
      "1 tablespoon of cornstarch",
      "40ml cold water ",
      "20g granulated sugar",
      "Pinch of salt",
      "45g granulated sugar"

    ],
    "instructions": [
      "Defrost and drain frozen berries. Reserve the juice from the thawed berries.",
      "Add the cornstarch to a small bowl and dissolve by mixing with cold water.", 
      "Place 20g granulated sugar into a saucepan.", 
      "In a small bowl combine 45g of sugar and a pinch of salt and set aside for later.",
      "Pour berry juice into the saucepan with the 20g of sugar. On medium-high heat, stirring occasionally until it begins boiling.",
      "Lower the heat to medium, then add the cornstarch/water mixture to the pan and stir constantly until thick.",
      "Add the sugar/salt mixture to the saucepan and stir until sugar is melted.",
      "Remove pan from the heat and let it cool briefly.",
      "Pour mixture over the berries and fold it in until all the berries are coated."
    ],
    "image": "recipe-images/tarts.jpeg",
    "time": "15 mins",
    "allergens": "nut-free",
    "updated": "09/10/2025",
    "source": "https://dessertswithstephanie.com/triple-berry-tart-recipe/"
  },
  {
    "title": "No Bake Cookie Dough (6 balls)",
    "ingredients": [
      "⅜ (86g) cup butter, room temperature (use vegan or dairy-free if needed)",
      "¼ (50g) cup granulated sugar",
      "¼ (55g) cup firmly packed brown sugar",
      "½ Tablespoon vanilla extract",
      "¼ teaspoon salt",
      "⅝ cups (75g) all purpose gluten-free flour",
      "⅙ (30g) cup chocolate chips (or to your heart's content), dairy-free if needed"

    ],
    "instructions": [
      "In a microwave safe bowl, place your measured gluten-free flour. Heat it for 60 seconds, or until it reaches a temperature of 165 degrees F. Stir to make sure the heat evenly distributes. Place the heat treated flour in the freezer for ten minutes while you make the rest of the recipe. If you use it when it's hot, it will melt the chocolate chips.",
      "In a large mixing bowl, place your room temperature butter (needs to be soft) sugars and vanilla.", 
      "Beat with electric beaters (or by hand) until creamed.", 
      "Add your cooled gluten free flour and mix until combined.",
      "Stir in your chocolate chips.",
      "Shape into balls and enjoy.",
      "To store, keep in an air tight container for up to one week, or freeze for up to 6 months."
    ],
    "image": "recipe-images/cookie_dough.jpeg",
    "time": "10 mins",
    "allergens": "gluten-free, nut-free",
    "updated": "12/12/2025",
    "source": "Anonymous"
  },
  {
    "title": "12 Mini Baked Cheesecake",
    "ingredients": [
      "250g cream cheese (softened to room temperature)",
      "½ cup granulated sugar",
      "½ tsp vanilla essence",
      "2 eggs",
      "9 digestives (~135g)",
      "60g melted butter"
    ],
    "instructions": [
      "Preheat oven to 180C (160C fan)",
      "Add digestives to a ziplock bag and crush them into fine crumbs.",
      "Add the crushed biscuits and melted butter into a bowl and stir well to combine.",
      "Place the mixture into the cupcake liners, flatten and set aside",
      "Beat softened cream cheese, sugar, vanilla with electric mixer until smooth.",
      "Add eggs and beat again until well combined.",
      "Place cream cheese mixture evenly into the liners and bake for 15mins or until the centre wobbles lightly.",
      "Remove from the oven and set aside to cool for 10 mins."
    ],
    "image": "recipe-images/12_mini_cheesecakes.jpeg",
    "time": "50 mins",
    "allergens": "nut-free",
    "updated": "01/01/2026",
    "source": "https://tilgoldenbrown.com/mini-baked-cheesecakes/"
  },
  {
    "title": "Rocky Road",
    "ingredients": [
      "250g digestives",
      "200g milk chocolate",
      "50g dark chocolate",
      "170g butter (or margarine)",
      "15ml golden syrup",
      "125g mini marshmallows",
      "Any other inclusions"
    ],
    "instructions": [
      "Add digestives to a ziplock bag and crush them into pieces(a mixture of anything between dust and 50p sized lumps)",
      "In a saucepan, melt butter, chocolate and golden syrup stirring until there are no lumps. Then remove from the heat.",
      "Mix in the digestive and marshmallows until everything is completely covered",
      "Tip the mixture into a container, mix in any other inclusions and press it down.",
      "Decorate however you like.",
      "Put in the fridge until set."
    ],
    "image": "recipe-images/rockyroad.jpeg",
    "time": "20 mins",
    "allergens": "nut-free",
    "updated": "01/01/2026",
    "source": "https://www.bbcgoodfood.com/recipes/easy-rocky-road"
  }

]