[
  {
    "title": "Chocolate Brownies",
    "ingredients": [
      "½ cup unsalted Flora butter block (115g)",
      "1 cup granulated sugar (200g)",
      "2 large eggs",
      "1 tsp vanilla extract (5g)",
      "¾ cup gluten free plain flour (95g)",
      "¼ cup unsweetened cocoa powder (25g)",
      "½ tsp salt (3g)",
      "milk chocolate chunks (150g)",
      "dark chocolate chips (100g) (50% - 60%)"
    ],
    "instructions": [
      "Preheat oven to 175°C. Line an 8x8-inch tray with parchment paper or grease well.",
      "In a heatproof bowl over simmering water (or microwave in short bursts), melt butter and dark chocolate chips with 1/4 of the milk chocolate chunks, stirring until smooth and glossy. Let it cool slightly.",
      "In a mixing bowl, whisk together sugar, eggs, and vanilla until smooth and glossy.",
      "Slowly pour the melted chocolate mixture into the egg mixture while whisking gently to combine.",
      "Sift in flour, cocoa powder, and salt, then fold in gently until just combined. Don’t overmix.",
      "Fold in the remaining milk chocolate chunks.",
      "Pour batter into the pan and smooth the top.",
      "Bake for 22-25 minutes. Edges should be set but the centre slightly soft and fudgy. A toothpick should come out with moist crumbs, not clean.",
      "Let cool completely before slicing (or eat warm)."
    ],
    "image": "recipe-images/chocolate_brownies.jpg",
    "time": "45 mins", 
    "allergens": "gluten-free, nut-free",
    "updated": "30/08/2025",
    "source": "Baking Society"
  },
  {
    "title": "Baking Soc Cupcakes",
    "ingredients": {
      "batter": [
        "150g gluten free self-raising flour",
        "0.13 tsp salt",
        "2 large eggs",
        "150g caster sugar",
        "60g Flora Unsalted butter block, melted and cooled slightly",
        "125ml soya milk",
        "2 tsp vanilla extract",
        "15g vegetable oil"
      ],
      "frosting": [
        "150g Flora Unsalted Butter Block (softened)",
        "275g icing sugar, sifted",
        "1 tsp vanilla extract",
        "Purple food colouring (gel/paste)"
      ],
      "decoration": [
        "Sugar pearls",
        "Toothpicks, paper cut-outs, stickers"
      ]
    },
    "instructions": [
      "Preheat oven to 180°C (160°C fan). Line a 12-hole muffin tray with cupcake cases.",
      "Whisk self-raising flour and salt in a medium bowl.",
      "In a large bowl, whisk eggs and caster sugar until pale and slightly thick (1–2 mins).",
      "Add melted butter, oil, milk, and vanilla extract. Whisk until combined.",
      "Fold in dry ingredients gently until smooth. Do not overmix.",
      "Divide batter evenly into 12 cases (~⅔ full).",
      "Bake 18–22 minutes, until tops are golden and spring back when pressed. Do the toothpick test.",
      "Cool in the tin for 5 minutes, then transfer to a wire rack to cool completely.",
      "Make the frosting: beat butter for 2 minutes until creamy. Add half the icing sugar, beat, then add the rest. Mix in vanilla and purple colouring. Adjust with milk or sugar if needed.",
      "Decorate: pipe frosting with a star tip, sprinkle with sugar pearls, and add toppers."
    ],
    "image": "recipe-images/baking_soc_cupcakes.jpg",
    "time": "1hr 30 mins", 
    "allergens": "gluten-free, lactose-free, dairy-free",
    "updated": "30/08/2025",
    "source": "Baking Society"
  },
  {
    "title": "Butter Cookies",
    "ingredients": [
      "200g salted Flora Butter Block, at room temperature",
      "70g icing sugar, sifted",
      "½ tsp vanilla bean paste or vanilla extract",
      "210g gluten free plain flour, sifted",
      "30g corn starch",
      "20g soya milk",
      "Granulated sugar for finishing, optional"
    ],
    "instructions": [
      "Preheat the oven to 165°C. Line a baking sheet with parchment paper.",
      "Fit a piping bag with a large open star tip.",
      "Whip butter, sugar, and vanilla until light and fluffy.",
      "Mix in flour and corn starch just until incorporated. Add soya milk and mix again.",
      "Transfer mixture to piping bag. Pipe rosettes about 4.5 cm wide, leaving room for spreading.",
      "Sprinkle with granulated sugar if using.",
      "Bake 13–14 minutes, until set and lightly golden at edges (longer for crunchier cookies).",
      "Cool on the pan 15–20 minutes, then transfer to a rack.",
      "Store in an airtight container at room temperature for up to a week."
    ],
    "image": "recipe-images/butter_cookies.jpg",
    "time": "30 mins", 
    "allergens": "gluten-free, egg-free, dairy-free",
    "updated": "30/08/2025",
    "source": "cloudykitchen"
  },
  {
    "title": "Matcha Brownies",
    "ingredients": [
      "100g butter",
      "150g white chocolate",
      "2 eggs",
      "10g matcha powder",
      "80g low-gluten flour (or gluten-free plain flour)",
      "60g granulated sugar"
    ],
    "instructions": [
      "Melt butter, add white chocolate, and mix well until smooth.",
      "Beat eggs with sugar until combined.",
      "Gradually add the egg mixture into the chocolate-butter mixture, mixing gently.",
      "Sieve flour and matcha powder, then fold into the mixture until combined.",
      "Pour batter into a mold.",
      "Bake at 180°C for 15 minutes. Cover with foil and bake for another 10 minutes to prevent over-coloring.",
      "Cool completely before eating.",
      "Note: Brownies improve in flavor with time. Store well-sealed for long shelf life, suitable for gifting or mailing as snacks."
    ],
    "image": "recipe-images/matcha_brownies.jpg",
    "time": "30 mins",
    "allergens": "gluten-free, nut-free",
    "updated": "30/08/2025",
    "source": "Anonymous"
  }
]